#ifndef SCHOOLNAMECONSTS_H
#define SCHOOLNAMECONSTS_H

#include <QPair>
#include <QString>

const QPair<QString, int> schoolname[20][20] =
{
  {{"Сош №1", 170101}, {"Сош №2", 170102}, {"Сош №3", 170103}, {"Сош №4", 170104}, {"Сош №5", 170105}, {"Сош №7", 170107}, {"Сош №8", 170108}, {"Сош №9", 170109}, {"Сош №11", 170111}, {"Сош №12", 170112}, {"Сош №14", 170114}, {"Сош №15", 170115}},
  {{"Ак-Довурак №1", 170201}, {"Ак-Довурак №2", 170202}, {"Ак-Довурак №3", 170203}, {"Ак-Довурак №4", 170204}},
  {{"Тээли", 170301}, {"Бай-Тал", 170302}, {"Кара-Хол", 170303}, {"Кызыл-Даг", 170304}, {"Найырал", 170305}, {"Хемчик", 170306}, {"Шуй", 170307}, {"Тээли ОСОШ", 170308}},
  {{"Кызыл-Мажалык №1", 170401}, {"Кызыл-Мажалык №2", 170402}, {"Аксы-Барлык", 170403}, {"Аянгаты", 170404}, {"Барлык", 170405}, {"Бижиктиг-Хая", 170406}, {"Дон-Терезин", 170407}, {"Хонделен", 170408}, {"Шекпээр", 170409}, {"Эрги-Барлык", 170410}, {"ОСОШ", 170411}},
  {{"Чадан №1", 170501}, {"Чадан №2", 170502}, {"Чадан №3", 170503}, {"Чадан №4", 170504}, {"Бажын-Алаак", 170505}, {"Баян-Тала", 170506}, {"Ийме", 170507}, {"Теве-Хая", 170508}, {"Хайыракан", 170509}, {"Хондергей", 170510}, {"Хорум-Даг", 170511}, {"Чыраа-Бажы", 170512}, {"Чыргакы", 170513}, {"Шеми", 170514}, {"ОСОШ", 170515}},
  {{"Сарыг-Сеп №1", 170601}, {"Сарыг-Сеп №2", 170602}, {"Бояровка", 170603}, {"Бурен-Бай-Хаак", 170604}, {"Бурен-Хем", 170605}, {"Дерзиг-Аксы", 170606}, {"Ильинка", 170607}, {"Кок-Хаак", 170608}, {"Кундустуг", 170609}, {"Сизим", 170610}, {"Суг-Бажы", 170611}, {"Усть-Бурен", 170612}, {"ОСОШ", 170613}},
  {{"Каа-Хем №1", 170701}, {"Каа-Хем №2", 170702}, {"Баян-Кол", 170703}, {"Кара-Хаак", 170704}, {"Сукпак", 170705}, {"Терлиг-Хая", 170706}, {"Усть-Элегест", 170707}, {"Целинная", 170708}, {"Черби", 170709}, {"Шамбалыг", 170710}, {"Ээрбек", 170711}, {"ОСОШ", 170712}},
  {{"Мугур-Аксы №1", 170801}, {"Мугур-Аксы №2", 170802}, {"Моген-Бурен", 170803}},
  {{"Хандагайты", 170901}, {"Ак-Чыраа", 170902}, {"Дус-Даг", 170903}, {"Саглы", 170904}, {"Солчур", 170905}, {"Чаа-Суур", 170906}},
  {{"Туран №1", 171001}, {"Туран №2", 171002}, {"Аржаан", 171003}, {"Сесерлиг", 171004}, {"Сушь", 171005}, {"Тарлаг", 171006}, {"Уюк", 171007}, {"Хадын", 171008}, {"Шивилиг", 171009}, {"ОСОШ", 171010}},
  {{"Суг-Аксы", 171101}, {"Алдан-Маадыр", 171102}, {"Ак-Даш", 171103}, {"Бора-Тайга", 171104}, {"Кара-Чыраа", 171105}, {"Кызыл-Тайга", 171106}, {"Хор-Тайга", 171107}, {"УКП Суг-Аксы", 171117}},
  {{"Бай-Хаак", 171201}, {"Балгазын", 171202}, {"Владимировка", 171203}, {"Кочетова", 171204}, {"Кызыл-Арыг", 171205}, {"Межегей", 171206}, {"Сосновка", 171207}, {"Успенка", 171208}, {"ОСОШ", 171209}},
  {{"Кунгуртуг", 171301}},
  {{"Самагалтай №1", 171401}, {"Самагалтай №2", 171402}, {"Берт-Даг", 171403}, {"Кызыл-Чыраа", 171404}, {"О-Шынаа", 171405}, {"У-Шынаа", 171406}, {"Чыргаланды", 171407}, {"Шуурмак", 171408}, {"ОСОШ", 171409}},
  {{"Тоора-Хем", 171501}, {"Адыр-Кежик", 171502}, {"Ий", 171503}, {"Ырбан", 171504}, {"ОСОШ", 171505}},
  {{"Шагонар №1", 171601}, {"Шагонар №2", 171602}, {"Гимназия", 171603}, {"Арыг-Бажы", 171604}, {"Арыг-Узуу", 171605}, {"Арыскан", 171606}, {"Ийи-Тал", 171607}, {"Иштии-Хем", 171608}, {"Торгалыг", 171609}, {"Хайыракан", 171610}, {"Чааты", 171611}, {"Эйлиг-Хем", 171612}, {"ОСОШ", 171613}},
  {{"Чаа-Холь", 171701}, {"Ак-Дуруг", 171702}, {"Булун-Терек", 171703}, {"Шанчы", 171704}},
  {{"Хову-Аксы", 171801}, {"Ак-Тал", 171802}, {"Сайлыг", 171803}, {"Чал-Кежик", 171804}, {"Элегест", 171805}, {"ОСОШ", 171806}},
  {{"Эрзин", 171901}, {"Бай-Даг", 171902}, {"Качык", 171903}, {"Кызыл-Сылдыс", 171904}, {"Морен", 171905}, {"Нарын", 171906}, {"УКП Эрзин", 171907}},
  {{"ТывГУ", 172001}, {"Агролицей", 172002}, {"Реслицей", 172003}, {"Гослицей", 172004}, {"Школа-Интернат", 172005}, {"Кадеты", 172006}, {"Надежда", 172026}, {"РШИ", 172008}}
};

const int schoolcnt[] = {12, 4, 8, 11, 15, 13, 12, 3, 6, 10, 8, 9, 1, 9, 5, 13, 4, 6, 7, 8};

#endif // SCHOOLNAMECONSTS_H
